{
  "customer_name": "Sarah Mitchell",
  "customer_unique_id": "CC789654321",
  "support_agent_name": "Marcus Thompson",
  "support_agent_id": "AGT_MT_4521",
  "call_transcript": "Agent: Thank you for calling SecureCard Customer Service, this is Marcus speaking. How can I help you today?\n\nCustomer: Hi Marcus, I'm calling because I just checked my account online and there are some charges I don't recognize. I'm really worried someone might have stolen my card information.\n\nAgent: I completely understand your concern, Sarah. Let me help you with this right away. First, I need to verify some information. Can you please provide me with your full name and the last four digits of your card?\n\nCustomer: Yes, it's Sarah Mitchell, and the last four digits are 8742.\n\nAgent: Perfect, thank you. And can you confirm your billing zip code?\n\nCustomer: 90210.\n\nAgent: Great, I have your account pulled up now. I can see you're one of our Premium cardholders. Now, can you tell me which charges you don't recognize?\n\nCustomer: Well, there's a charge for $127.50 at something called 'Digital Media Solutions' on September 3rd, and another one for $89.99 at 'TechGear Online' yesterday. I've never shopped at either of these places.\n\nAgent: I understand your concern. Let me look at these transactions in detail. The first charge for $127.50 was made online on September 3rd at 2:47 PM. The second charge for $89.99 was also made online on September 5th at 11:23 AM. Do these times correspond with when you might have been shopping online or when someone else might have had access to your card?\n\nCustomer: No, on September 3rd I was at work all day, and yesterday I was at my daughter's school event. I definitely wasn't shopping online during those times.\n\nAgent: Thank you for that information. Based on what you're telling me, these do appear to be unauthorized transactions. I'm going to immediately flag these charges as fraudulent and start a dispute process for you. I'm also going to block your current card to prevent any additional unauthorized use.\n\nCustomer: Oh good, thank you. How long will this take to resolve?\n\nAgent: The dispute process typically takes 5-7 business days for the provisional credit to appear in your account, and the full investigation can take up to 30 days. However, I can provide you with a provisional credit for the full amount of $217.49 within 24 hours.\n\nCustomer: That sounds good. Will I need a new card?\n\nAgent: Yes, I'm issuing you a new card immediately. Since you're a Premium member, I can expedite shipping at no charge. You should receive your new card within 2 business days. In the meantime, I'm setting up a temporary digital card that you can use for online purchases or add to your mobile wallet.\n\nCustomer: That's perfect. What should I do if I see any other suspicious charges?\n\nAgent: If you notice any other unauthorized transactions, please call us immediately at this same number. I'm also going to set up fraud monitoring on your new account, which will send you text alerts for any unusual spending patterns.\n\nCustomer: Excellent. Is there anything else I need to do?\n\nAgent: I'd recommend checking your other accounts and credit reports just to be safe. Also, if you've saved your card information on any websites, you'll need to update those with your new card information once you receive it.\n\nCustomer: Got it. And you said the money will be back in my account within 24 hours?\n\nAgent: That's correct. The provisional credit of $217.49 will appear in your account by tomorrow evening. You'll receive an email confirmation of this dispute case within the next hour, and another email when your new card ships.\n\nCustomer: This is great service, Marcus. I was so worried, but you've made this really easy.\n\nAgent: I'm so glad I could help, Sarah. Is there anything else I can assist you with today?\n\nCustomer: No, that covers everything. Thank you so much for your help.\n\nAgent: You're very welcome. Have a great day, and don't hesitate to call if you have any other questions.\n\nCustomer: Thank you, bye.\n\nAgent: Goodbye.",
  "overall_satisfaction_score": 9,
  "category_of_call": "Fraud Reporting",
  "call_duration": 12,
  "call_date_time": "2025-09-06 14:32:00",
  "call_resolution_status": "Resolved",
  "escalation_level": "None",
  "follow_up_required": "No",
  "customer_tier": "Premium",
  "issue_severity": "High",
  "agent_experience_level": "Senior",
  "customer_previous_contact_count": 0
}
