{
  "customer_name": "Michael Thompson",
  "customer_unique_id": "CC987654321",
  "support_agent_name": "Lisa Rodriguez",
  "support_agent_id": "AGT_LR_5673",
  "call_transcript": "Agent: Thank you for calling SecureCard Customer Service, this is Lisa. How may I help you today?\n\nCustomer: Hi Lisa, I need to report my credit card as lost. I think I left it at a restaurant last night and I can't find it anywhere.\n\nAgent: I'm sorry to hear about your lost card, Michael. I'll be happy to help you with this right away. For your security, I need to verify your account first. Can you please provide your full name and the last four digits of the card that's missing?\n\nCustomer: Yes, it's Michael Thompson, and I think the last four digits are 9876. Actually, wait, let me check... I have a photo of it on my phone from when I set up autopay. Yes, 9876.\n\nAgent: Thank you. Can you also confirm your billing address?\n\nCustomer: Sure, it's 542 Oak Street, Dallas, Texas 75201.\n\nAgent: Perfect, I have your account pulled up. I can see you're a Premium member with us. Now, when did you last remember having the card?\n\nCustomer: Last night around 8 PM at Giovanni's Italian Restaurant. I paid for dinner and I think I might have left it on the table by accident. I called them this morning but they said they didn't find any cards.\n\nAgent: I understand. To protect your account, I'm going to immediately block this card so no unauthorized charges can be made. Let me do that right now... Okay, your card ending in 9876 is now blocked. No one can use it for any transactions.\n\nCustomer: Great, thank you. How quickly can I get a replacement?\n\nAgent: As a Premium member, I can expedite your replacement card at no charge. However, I need to ask - do you need this card for any upcoming travel or urgent purchases?\n\nCustomer: Actually, yes! I'm flying to New York tomorrow morning for a business trip. I need a card for the trip.\n\nAgent: Okay, that does complicate things. Our expedited shipping normally takes 2-3 business days, which means you might not receive it before your trip. Let me see what options we have...\n\nCustomer: Can't you overnight it?\n\nAgent: Let me check our premium services... Unfortunately, we don't offer overnight shipping for replacement cards, even for Premium members. However, I have a few alternatives that might help.\n\nCustomer: What are the alternatives?\n\nAgent: First, I can set up a temporary digital card that you can add to your phone's digital wallet. You can use this for contactless payments and online purchases during your trip. Second, I can check if there's a partner bank branch in Dallas where you could pick up a temporary card today.\n\nCustomer: The digital card sounds good. How does that work?\n\nAgent: I'll generate a temporary digital card with a new card number that you can use until your physical replacement arrives. You can add it to Apple Pay or Google Pay on your phone. However, there is one limitation - not all merchants accept digital payments, especially smaller businesses.\n\nCustomer: What about cash advances? Can I get cash with the digital card?\n\nAgent: Unfortunately, no. Digital cards can't be used for cash advances or at ATMs. For cash access, you'd need the physical card or you could visit one of our partner bank locations.\n\nCustomer: This is getting complicated. Are there any partner banks in Dallas?\n\nAgent: Let me check our partner network for Dallas... I'm showing three locations, but I need to call them to confirm they can issue temporary cards for Premium members. Would you mind holding for a few minutes while I check?\n\nCustomer: Sure, but I really need to know today since I'm flying early tomorrow.\n\nAgent: Absolutely, I understand the urgency. Please hold while I check...\n\n[Customer on hold for 4 minutes]\n\nAgent: Thank you for holding, Michael. I have mixed news. Two of the three partner locations can issue temporary cards, but they require you to come in with two forms of ID and there's a $35 fee that I cannot waive.\n\nCustomer: $35? That seems steep for something that's not really my fault.\n\nAgent: I understand your frustration. Let me see what I can do... I can apply a $35 statement credit to your account to offset this fee, so essentially the temporary card would be free for you.\n\nCustomer: Okay, that's better. Where are these locations and what are their hours?\n\nAgent: The closest one to your address is First National Bank on Elm Street, about 10 minutes from you. They're open until 6 PM today. The other location is downtown but closes at 5 PM. I'll text you both addresses.\n\nCustomer: Perfect. What do I need to bring?\n\nAgent: You'll need two forms of ID - your driver's license and either a passport, utility bill, or bank statement. I'm also sending you a authorization code via text that you'll need to show them.\n\nCustomer: Got it. What about the digital card? Can you set that up too, just in case?\n\nAgent: Absolutely! I'm creating that now... Your temporary digital card is ready. The card number, expiration date, and CVV are being sent to your email address ending in @gmail.com. You can add this to your digital wallet immediately.\n\nCustomer: And my regular replacement card?\n\nAgent: That's already being processed and will ship tomorrow. You should receive it by Monday. I'll also send you tracking information once it ships.\n\nCustomer: This has been more complicated than I expected, but you've found solutions. I appreciate that.\n\nAgent: I'm glad we could work this out for your trip. Just to recap: you have a digital card in your email, authorization to get a temporary physical card today, a $35 statement credit, and your permanent replacement shipping tomorrow.\n\nCustomer: Yes, that covers all my bases. Thank you, Lisa.\n\nAgent: You're very welcome, Michael. Have a safe trip to New York! Is there anything else I can help you with today?\n\nCustomer: No, that's everything. Thanks again for all your help.\n\nAgent: My pleasure! Have a great day and a successful business trip.\n\nCustomer: Thank you, goodbye!\n\nAgent: Goodbye!",
  "overall_satisfaction_score": 7,
  "category_of_call": "Lost/Stolen Card",
  "call_duration": 16,
  "call_date_time": "2025-09-06 13:20:00",
  "call_resolution_status": "Resolved",
  "escalation_level": "None",
  "follow_up_required": "No",
  "customer_tier": "Premium",
  "issue_severity": "Medium",
  "agent_experience_level": "Senior",
  "customer_previous_contact_count": 0
}
