{
  "customer_name": "Angela Roberts",
  "customer_unique_id": "CC890123456",
  "support_agent_name": "Kevin Wright",
  "support_agent_id": "AGT_KW_3456",
  "call_transcript": "Agent: Thank you for calling SecureCard Customer Service, this is Kevin. How may I help you today?\n\nCustomer: Kevin, I am extremely frustrated right now. I've been charged a late fee and interest charges, but I paid my bill on time. This is the second month in a row this has happened, and I'm sick of it.\n\nAgent: I'm very sorry to hear about this billing issue, Angela. Let me help you resolve this right away. I can understand how frustrating repeated billing errors would be. Can you please verify your account with your full name and the last four digits of your card?\n\nCustomer: Angela Roberts, 5678. And I want to speak to a supervisor about this because your regular customer service clearly can't fix this problem.\n\nAgent: I understand your frustration, and I'll be happy to get a supervisor involved if needed. But let me first take a look at your account to understand exactly what's happening. Can you also confirm your zip code?\n\nCustomer: 10012. Look, I've been through this drill twice already. I pay my bill online every month on the same date, three days before it's due. But somehow your system keeps saying I'm late.\n\nAgent: I can see how aggravating that would be. Let me pull up your payment history... I can see your Elite account here, and I'm looking at the last few months of payments. I see payments on July 28th, August 27th, and September 3rd. Your due dates were August 1st, September 1st, and September 6th.\n\nCustomer: Exactly! I paid three days early each time, just like I always do.\n\nAgent: I see the issue now, and I need to apologize on behalf of SecureCard. Looking at the timestamps, your payments were submitted in the evening after 8 PM on each of those dates. Our system processes online payments made after 8 PM Eastern time as being received the next business day.\n\nCustomer: That's ridiculous! Your website doesn't say anything about a cutoff time. I've been paying the same way for three years and never had this problem before.\n\nAgent: You're absolutely right, and this is actually a policy change that went into effect in July. Previously, all online payments made before midnight were processed the same day. I can see why you wouldn't know about this change - the notification should have been more prominent.\n\nCustomer: So you're telling me this is your fault, not mine?\n\nAgent: Yes, this appears to be a communication failure on our part. The policy change should have been better communicated to customers, especially those with automatic payment habits like yours. Let me see what I can do to resolve this.\n\nCustomer: I want all these late fees and interest charges removed, and I want this fixed so it doesn't happen again.\n\nAgent: Absolutely, that's completely reasonable. Let me calculate the charges... I can see late fees of $29 in August and $29 in September, plus interest charges totaling $47.83. However, I'm only authorized to reverse up to $50 in fees per call.\n\nCustomer: Only $50? The total is over $100! This is exactly why I want to speak to a supervisor.\n\nAgent: I completely understand, and I think that's the right call in this situation. Before I transfer you, let me reverse the $50 that I'm authorized to handle, and I'll prepare a detailed case summary for the supervisor.\n\nCustomer: Fine, do that. But I want the supervisor to have the authority to fix this completely.\n\nAgent: Absolutely. I'm reversing $50 in late fees right now... Done. I'm also preparing notes that explain this was due to the policy change not being properly communicated. Let me connect you with Supervisor Sarah Mitchell.\n\n[Transfer to supervisor]\n\nSupervisor: Hello Angela, this is Sarah Mitchell, a Customer Service Supervisor. Kevin has briefed me on your situation, and I want to apologize for the billing issues you've experienced.\n\nCustomer: Thank you. I just want this resolved properly. I've been a customer for years and I've never been late on a payment when I actually was responsible for being late.\n\nSupervisor: I completely understand, and Kevin was right to escalate this to me. Looking at your account, you're clearly a responsible customer who was affected by our policy change. I'm going to reverse all remaining charges - the additional $55.83 in fees and interest.\n\nCustomer: Good, that's what should happen.\n\nSupervisor: I'm also going to make a permanent note on your account about your payment timing preference. Going forward, any online payment you make after 8 PM will be manually processed as same-day, so this won't happen again.\n\nCustomer: Wait, can you do that?\n\nSupervisor: For Elite customers who've been affected by this policy change, yes. It's a manual override that I can authorize. You'll be able to continue paying the way you always have.\n\nCustomer: That's more like it. What about other customers who might have this same problem?\n\nSupervisor: That's an excellent point. I'm forwarding your case to our Policy Review team as feedback about the communication around this change. Your experience will help us improve how we handle policy changes in the future.\n\nCustomer: I hope so. I shouldn't have had to escalate this to get a fair resolution.\n\nSupervisor: You're absolutely right, and I apologize that it took a supervisor call to resolve this properly. Is there anything else I can do for your account today?\n\nCustomer: I think this covers it, as long as I don't have to worry about this happening again.\n\nSupervisor: You won't. The account override is permanent, and you'll receive email confirmation of all the reversed charges within an hour. Thank you for bringing this to our attention, Angela.\n\nCustomer: Alright, thank you for actually fixing this, Sarah.\n\nSupervisor: You're very welcome. Have a great day, and please don't hesitate to ask for a supervisor immediately if you have any other concerns.\n\nCustomer: I will. Goodbye.\n\nSupervisor: Goodbye!",
  "overall_satisfaction_score": 6,
  "category_of_call": "Billing Error",
  "call_duration": 19,
  "call_date_time": "2025-09-06 16:20:00",
  "call_resolution_status": "Resolved",
  "escalation_level": "Supervisor",
  "follow_up_required": "No",
  "customer_tier": "Elite",
  "issue_severity": "High",
  "agent_experience_level": "Junior",
  "customer_previous_contact_count": 2
}
