{
  "customer_name": "Rebecca Foster",
  "customer_unique_id": "CC678901234",
  "support_agent_name": "Daniel Park",
  "support_agent_id": "AGT_DP_4567",
  "call_transcript": "Agent: Thank you for calling SecureCard Customer Service, this is Daniel speaking. How can I help you today?\n\nCustomer: Hi Daniel, I need to dispute a charge on my account. I was charged for something I didn't purchase, and when I contacted the merchant, they were completely unhelpful.\n\nAgent: I'm sorry to hear you're having trouble with a merchant charge, Rebecca. I'll be happy to help you with this dispute. First, let me verify your account. Can you provide your full name and the last four digits of your card?\n\nCustomer: Rebecca Foster, and the last four digits are 2468.\n\nAgent: Thank you. And your billing zip code?\n\nCustomer: 20001.\n\nAgent: Perfect, I have your Premium account here. Now, can you tell me about the charge you want to dispute?\n\nCustomer: It's a charge for $289.99 from 'TechWorld Online' on August 30th. I never ordered anything from them, and I've never even heard of this company before seeing it on my statement.\n\nAgent: I understand your concern. Let me pull up that transaction... I can see the charge you're referring to - $289.99 from TechWorld Online on August 30th at 3:42 PM. It shows as an online purchase. You mentioned you contacted the merchant - what did they say?\n\nCustomer: I called them yesterday and the person I spoke to was really rude. They insisted I must have ordered something and that they have record of the purchase. But I definitely did not order anything from them. They refused to provide any details about what was supposedly ordered or where it was shipped.\n\nAgent: That's definitely frustrating, and their lack of cooperation is concerning. In cases like this, we can absolutely help you dispute the charge. Let me ask a few questions to build a strong case. Do you recognize the merchant name 'TechWorld Online' from any online shopping you might have done?\n\nCustomer: No, I've never heard of them. I mainly shop at Best Buy, Amazon, and Apple's website for electronics.\n\nAgent: And on August 30th, do you recall what you were doing around 3:42 PM? Were you online shopping or using your card anywhere?\n\nCustomer: Let me think... August 30th was a Wednesday. I was at work all afternoon. I definitely wasn't online shopping during work hours. I think I used my card that day to buy lunch around noon, but that's it.\n\nAgent: That's helpful information. Now, have you received any packages or deliveries from unknown companies recently?\n\nCustomer: No, nothing. And I would definitely notice since I work from home most days and accept all my deliveries personally.\n\nAgent: Perfect. Based on what you're telling me, this does appear to be an unauthorized charge. I'm going to start the dispute process for you right now. I'll need to ask you to complete a brief affidavit confirming you didn't make this purchase.\n\nCustomer: Okay, how do I do that?\n\nAgent: I can handle most of it over the phone right now. I need you to confirm under penalty of perjury that: You did not make or authorize this $289.99 purchase from TechWorld Online on August 30th, you did not receive any merchandise from this merchant, and you did not give anyone permission to use your card for this purchase. Do you confirm all of these statements?\n\nCustomer: Yes, I confirm all of that. This was definitely not my purchase.\n\nAgent: Thank you. I'm filing the dispute now... Your case number is DS-2025-0906-7821. I'm also issuing you a provisional credit of $289.99, which should appear in your account within 24-48 hours.\n\nCustomer: That's great! How long does the investigation take?\n\nAgent: The investigation typically takes 30-60 days. During this time, our fraud investigation team will work with the merchant to get documentation about the purchase. If they can't provide sufficient evidence that you authorized the transaction, the provisional credit becomes permanent.\n\nCustomer: What kind of documentation would they need to provide?\n\nAgent: They would need to show proof that you initiated the purchase - things like IP address logs matching your location, delivery confirmation to your address, or other evidence of authorization. Given that you never received any merchandise and weren't online shopping at that time, it would be very difficult for them to provide such proof.\n\nCustomer: That makes sense. What do I need to do while you're investigating?\n\nAgent: Just keep monitoring your account for any other suspicious charges. If you see anything else unusual, call us immediately. I'm also going to recommend that we send you a new card with a new number, just as a precaution.\n\nCustomer: Is that necessary? I mean, this might just be one fraudulent merchant.\n\nAgent: It's not required, but I recommend it because we don't know how TechWorld Online got your card information. If there's been a data breach somewhere, your card number might be compromised. The replacement is free for Premium members.\n\nCustomer: Okay, that makes sense. How long for the new card?\n\nAgent: I can expedite it at no charge, so you'll receive it within 2-3 business days. Your current card will remain active until you receive and activate the new one.\n\nCustomer: Perfect. Will I get updates on the dispute investigation?\n\nAgent: Yes, we'll send you email updates at key milestones, and you can always call us with your case number for status updates. You'll definitely be notified when the investigation is complete.\n\nCustomer: This has been really helpful, Daniel. I was worried about having to fight this myself.\n\nAgent: That's exactly what we're here for, Rebecca. Credit card disputes can be frustrating, but we have experienced investigators who handle these cases every day. Is there anything else I can help you with regarding this dispute or your account?\n\nCustomer: I think that covers everything. Thank you for making this so straightforward.\n\nAgent: You're very welcome! Remember, your case number is DS-2025-0906-7821, and you should see the provisional credit within 48 hours. Have a great day!\n\nCustomer: Thank you, you too!\n\nAgent: Goodbye!",
  "overall_satisfaction_score": 8,
  "category_of_call": "Transaction Dispute",
  "call_duration": 14,
  "call_date_time": "2025-09-06 11:30:00",
  "call_resolution_status": "Follow-up Required",
  "escalation_level": "None",
  "follow_up_required": "Yes",
  "customer_tier": "Premium",
  "issue_severity": "Medium",
  "agent_experience_level": "Senior",
  "customer_previous_contact_count": 0
}
